{
  "content": "(b) Wrong.\n\nMagnetic field lines (like electric field lines) can never cross each other, because otherwise the direction of field at the point of intersection is ambiguous.\n\nThere is further error in the figure.\n\nMagnetostatic field lines can never form closed loops around empty space.\n\nA closed loop of static magnetic field line must enclose a region across which a current is passing.\n\nBy contrast, electrostatic field lines can never form closed loops, neither in empty space, nor when the loop encloses charges.\n\n(c) Right. Magnetic lines are completely confined within a toroid. Nothing wrong here in field lines forming closed loops, since each loop encloses a region across which a current passes. Note, for clarity of figure, only a few field lines within the toroid have been shown. Actually, the entire region enclosed by the windings contains magnetic field.\n\n(d) Wrong. Field lines due to a solenoid at its ends and outside cannot be so completely straight and confined; such a thing violates Ampere's law. The lines should curve out at both ends, and meet eventually to form closed loops.\n\n(e) Right. These are field lines outside and inside a bar magnet. Note carefully the direction of field lines inside. Not all field lines emanate out of a north pole (or converge into a south pole). Around both the N-pole, and the S-pole, the net flux of the field is zero.",
  "header_path": "Solution",
  "line_ranges": [
    [
      249,
      249
    ],
    [
      251,
      251
    ],
    [
      253,
      253
    ],
    [
      255,
      255
    ]
  ],
  "source_file": "output/leph105/leph105.md",
  "chunk_index": 52,
  "total_chunks_in_file": 129,
  "summary": "Magnetic field lines never cross, always start at north poles of magnets and end at south poles.",
  "hypothetical_questions": [
    "What is the direction of magnetic field lines?",
    "When should we expect closed loops of magnetic field?",
    "What happens inside a bar magnet?"
  ],
  "keywords": [
    "magnetic field",
    "field lines",
    "crossing",
    "magnets",
    "flux"
  ],
  "global_chunk_index": 52
}